#include "AllHead.h"


/* -------------------------------- begin  ------------------------------ */
/**
  * @函数名:  delay_us
  * @参数1 : 需要延时多少微秒
  * @返回值: 无
 **/
/* -------------------------------- end -------------------------------- */

void delay_10us(u16 ten_us) //当传入ten_us==1时，大约延时10us
{
	while(ten_us--);
}

/* -------------------------------- begin  ------------------------------ */
/**
  * @从STC-ISP生成复制延时函数
  * @函数名:  Delay1ms
  * @参数1 : 需要延时多少毫秒
  * @返回值: 无
 **/
/* -------------------------------- end -------------------------------- */

/*void Delay1ms(unsigned int xms)		//@12.000MHz
{
	unsigned char i, j;
  while(xms)
	{
		i = 2;
		j = 239;
		do
		{
			while (--j);
		} while (--i);
		xms--;
	}
}*/

