#include "AllHead.h"




  /* -------------------------------- begin  ------------------------------ */
/**
  * @函数名:  EXTI0_Init
  * @功能 : 外部中断0初始化
  * @返回值: 无
 **/
/* -------------------------------- end -------------------------------- */
/*void EXTI0_Init(void)
{
	IT0 = 1; //跳变沿触发方式（下降沿）
	EX0 = 1; //打开 INT0 的中断允许
	EA = 1;  //打开总中断
}*/ 


/* -------------------------------- begin  ------------------------------ */
/**
  * @功能 : 外部中断0服务函数
 **/
/* -------------------------------- end -------------------------------- */
/*void EXTI0() interrupt 0  //外部中断0中断函数
{
	Delay1ms(10);   //消抖
	if(KEY3 == 0)   //再次判断 K3 键是否按下
		LED1 = !LED1; //LED1状态翻转
}*/