#include "AllHead.h"

/* -------------------------------- begin  ------------------------------ */
/**
  * @函数名:  Time0_Init
  * @功能 : 定时器0中断配置函数，通过设置 TH 和 TL 即可确定定时时间(使用工具可确定TH 与TL的值)
  * @返回值: 无                                                   晶振频率为11.0592
 **/
/* -------------------------------- end -------------------------------- */
/*void Time0_Init(void)
{
	TMOD |= 0x01; //选择为定时器0模式，工作方式1(为了不干扰T1定时器所以用|);如果是定时器1则把0x01改成0x10
	TH0 = 0xFC; //给定时器赋初值，定时1ms;如果是定时器1则把TH0改成TH1
	TL0 = 0X66; //如果是定时器1则把TL0改成TL1
	ET0 = 1;    //打开定时器0中断允许
	EA = 1;     //打开总中断
	TR0 = 1;    //打开定时器
}*/


/* -------------------------------- begin  ------------------------------ */
/**
  * @功能 : 定时器0中断服务函数
 **/
/* -------------------------------- end -------------------------------- */
	
/*void Time0() interrupt 1 //定时器0中断号为1
{

	static u16 count = 0; //定义静态变量count
  TH0 = 0xFC;           //给定时器赋初值，定时1ms
	TL0 = 0X66;
	count++;
	if(count == 500)     //1000ms=1s
	{
		count = 0;          //溢出然后重新赋0
		LED1 = !LED1;

	}
}*/