#include "AllHead.h"
/* -------------------------------- begin  ------------------------------ */
/**
  * @函数名:  Time0_Init
  * @功能 : 定时器0中断配置函数，通过设置 TH 和 TL 即可确定定时时间(使用工具可确定TH 与TL的值)
  * @返回值: 无                                                   晶振频率为11.0592
 **/
/* -------------------------------- end -------------------------------- */
void Time0_Init()
{
	EA = 1;        //开启总中断
	TMOD &= 0xF0;  //设置定时器模式
	TMOD |= 0x01;  //定时器模式1
	TH0 = 0XFC;    //定时1毫秒
	TL0 = 0x66;
	ET0 =1;        //使能定时器0中断
	TR0 = 1;       //启动定时器0
}